#+TITLE: My Config
#+PROPERTY: header-args :tangle config.el
#+STARTUP: overview

* General
#+BEGIN_SRC elisp
(setq user-full-name "Ieremies Vieira da Fonseca Romero"
      user-mail-address "ieremies@gmail.com"
      doom-font (font-spec :family "JetBrainsMono Nerd Font" :size 14)
      doom-theme 'doom-nord
      evil-want-fine-undo t
      ;; performance
      inhibit-compacting-font-caches t
      display-line-numbers-type nil
      frame-title-format "%f - Emacs"
      )
#+end_src

#+RESULTS:
: %f - Emacs

